<?php 

return array(

	/**
	 * text in Main site
	 */
	
	'sudactive'		=> 'سوداكتف',
	'title'		=> 'شخصيات سودانية',
	'slogan'	=> 'شخصيات سودانية',
	'search'	=> 'بحث عن اي اسم ... عمر الامين مثلا',
	'beta'		=> 'الموقع في النسخة التجريبية',
	'about'			=> 'عن سوداكتف',
	'join-us'		=> 'الانضمام ككاتب',
	'policy'		=> 'سياسة الموقع',
	'contact'		=> 'اتصل بنا',
	'read_more'		=> 'اقراء المزيد',
	'copyrights'	=> 'جميع الحقوق محفوظة لشبكة سوداكتف 2013 &copy;',
	'search_result'	=> 'نتائج بحث',

	"sidebar"		=> array(
		"join_call" 	=> "اذا رغبت ان تكون عضوا في سوداكتف ما عليك الا التسجيل حتى تستطيع المساهمة بمقالاتك",
		"join_now"    	=> "انضم الان",
	)

);