@extends('site.layout')

{{-- Web site Title --}}
@section('title')
@parent - 
سياسة الموقع
@stop

{{-- SEO - General Meta --}}
@section('meta_data')
  <link href="{{{ Config::get('app.url') }}}/policy" rel="canonical" />
  <meta name="description" content="اذا كان لديك اي اقتراح او فكرة او شكوى او اذا اردت انا تدعمنا لنواصل في العطاء او اذا اردت ان ترحب بنا فقط ، سنكون سعيدين جدا بالرد عليك في اقرب فرصة، شكرا لك" />
  <meta property="og:image" content="{{{ Config::get('app.url').'/img/sudactive-logo.jpg' }}}" />
  <meta property="og:title" content="سوداكتف - سياسة الموقع" />
  <meta property="og:description" content="اذا كان لديك اي اقتراح او فكرة او شكوى او اذا اردت انا تدعمنا لنواصل في العطاء او اذا اردت ان ترحب بنا فقط ، سنكون سعيدين جدا بالرد عليك في اقرب فرصة، شكرا لك" />
  <meta property="og:type" content="website" />
  <meta property="og:url" content="{{{ Config::get('app.url') }}}/policy" />
@stop

{{-- Breadcrumbs --}}
@section('breadcrumbs', Breadcrumbs::render('page','سياسة الموقع'))

{{-- Content --}}
@section('content')

  <div class="post">

    <h3>سياسة الموقع :</h3>

    <br />

    <h5>أي مقال ينشر في الموقع ينسب الى صاحبه :</h5>
    <p>
        بمعنى أن جميع الحقوق محفوظة لكاتب المقال، ولا يسمح بإجراء أي نسخ أو نشر للمقالات دون أخذ اذن الكاتب <strong>أو</strong> ذكر المصدر عند النسخ أو النشر،
        وبذلك لا يتحمل الموقع أي مسؤولية تتعلق بالمقالات المنشورة اذا كانت جمعت من مصادر غير موثوقة او أقتبست من دون ذكر المصدر، حيث تعود هذه المسؤولية لكاتب
        المقال ( المساهم ). نحن هنا في موقع شخصيات نسعى دوما لتقديم محتوى جيد ، بعمل فريق يراجع مصداقية هذه المقالات قبل نشرها والتاكد من صحتها.
    </p>

    <br />

    <h5>يسمح لكاتب المقال تعديل أو حذف أي مقال كتبه في الموقع :</h5>
    <p>
      لا توجد قيود صارمة في الموقع، اذا رأيت ان مقالك بحاجة الى تعديل أو اذا اردت حذفه لك الحرية في ذلك.
    </p>

     <br />
    
    <h5>يمكن للموقع نشر ونسخ أي مقال في الموقع دون الحوجة لاخذ أذن الكتاب :</h5>
    <p>
      وذلك حتى نستطيع أن ننشر هذه المقالات الى أكبر عدد من النوافذ الإعلامية، حيث مهمتنا الاساسية في الموقع هي نشر هذه المقالات.
    </p>

     <br />
    
    <p>سياسية الموقع متجددة باستمرار، نرجو منك متابعتها حين بعد حين</p>
    <br />

  </div>

@stop
